site.org
#+STARTUP: noindent showall
#+AUTHOR: Khayyam Saleem
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t

*** DONE Deploying this Site                                       :devops:
CLOSED: [2018-12-25 Tue 19:35]
:PROPERTIES:
:EXPORT_FILE_NAME: deploying-this-blog
:VISIBILITY: children
:END:

This site is built with Hugo on org-mode. The site is deployed on a DigitalOcean droplet. The intent is to have it build with Jenkins and automatically update the site every time I push to master. As of now, I've been able to set up a CI/CD workflow. Currently working on adding git-hooks. It has been a wild ride.

**** Getting Started
First, prioritize getting everything going on your local version. Don't prioritize deployment until you at least have something to show, because it is quite a hassle to get going in the beginning.

